MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4100-F64K128/mcu.h
/* -------------------------------  HRPWM0_HRCSTSG  ------------------------------- */
#define HRPWM0_HRCSTSG_H0STE_Pos              (0UL)                     /*!< HRPWM0 HRCSTSG: H0STE (Bit 0)                               */
#define HRPWM0_HRCSTSG_H0STE_Msk              (0x1UL)                   /*!< HRPWM0 HRCSTSG: H0STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTSG_H0DSTE_Pos             (1UL)                     /*!< HRPWM0 HRCSTSG: H0DSTE (Bit 1)                              */
#define HRPWM0_HRCSTSG_H0DSTE_Msk             (0x2UL)                   /*!< HRPWM0 HRCSTSG: H0DSTE (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRCSTSG_H1STE_Pos              (4UL)                     /*!< HRPWM0 HRCSTSG: H1STE (Bit 4)                               */
#define HRPWM0_HRCSTSG_H1STE_Msk              (0x10UL)                  /*!< HRPWM0 HRCSTSG: H1STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTSG_H1DSTE_Pos             (5UL)                     /*!< HRPWM0 HRCSTSG: H1DSTE (Bit 5)                              */
#define HRPWM0_HRCSTSG_H1DSTE_Msk             (0x20UL)                  /*!< HRPWM0 HRCSTSG: H1DSTE (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRCSTSG_H2STE_Pos              (8UL)                     /*!< HRPWM0 HRCSTSG: H2STE (Bit 8)                               */
#define HRPWM0_HRCSTSG_H2STE_Msk              (0x100UL)                 /*!< HRPWM0 HRCSTSG: H2STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTSG_H2DSTE_Pos             (9UL)                     /*!< HRPWM0 HRCSTSG: H2DSTE (Bit 9)                              */
#define HRPWM0_HRCSTSG_H2DSTE_Msk             (0x200UL)                 /*!< HRPWM0 HRCSTSG: H2DSTE (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRCSTSG_H3STE_Pos              (12UL)                    /*!< HRPWM0 HRCSTSG: H3STE (Bit 12)                              */
#define HRPWM0_HRCSTSG_H3STE_Msk              (0x1000UL)                /*!< HRPWM0 HRCSTSG: H3STE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTSG_H3DSTE_Pos             (13UL)                    /*!< HRPWM0 HRCSTSG: H3DSTE (Bit 13)                             */
#define HRPWM0_HRCSTSG_H3DSTE_Msk             (0x2000UL)                /*!< HRPWM0 HRCSTSG: H3DSTE (Bitfield-Mask: 0x01)                */

/* --------------------------------  HRPWM0_HRGHRS  ------------------------------- */
#define HRPWM0_HRGHRS_HRGR_Pos                (0UL)                     /*!< HRPWM0 HRGHRS: HRGR (Bit 0)                                 */
#define HRPWM0_HRGHRS_HRGR_Msk                (0x1UL)                   /*!< HRPWM0 HRGHRS: HRGR (Bitfield-Mask: 0x01)                   */


/* ================================================================================ */
/* ================       Group 'HRPWM0_CSG' Position & Mask       ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG_DCI  ------------------------------- */
#define HRPWM0_CSG_DCI_SVIS_Pos               (0UL)                     /*!< HRPWM0_CSG DCI: SVIS (Bit 0)                                */
#define HRPWM0_CSG_DCI_SVIS_Msk               (0xfUL)                   /*!< HRPWM0_CSG DCI: SVIS (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG_DCI_STRIS_Pos              (4UL)                     /*!< HRPWM0_CSG DCI: STRIS (Bit 4)                               */
#define HRPWM0_CSG_DCI_STRIS_Msk              (0xf0UL)                  /*!< HRPWM0_CSG DCI: STRIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG_DCI_STPIS_Pos              (8UL)                     /*!< HRPWM0_CSG DCI: STPIS (Bit 8)                               */
#define HRPWM0_CSG_DCI_STPIS_Msk              (0xf00UL)                 /*!< HRPWM0_CSG DCI: STPIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG_DCI_TRGIS_Pos              (12UL)                    /*!< HRPWM0_CSG DCI: TRGIS (Bit 12)                              */
#define HRPWM0_CSG_DCI_TRGIS_Msk              (0xf000UL)                /*!< HRPWM0_CSG DCI: TRGIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG_DCI_STIS_Pos               (16UL)                    /*!< HRPWM0_CSG DCI: STIS (Bit 16)                               */
#define HRPWM0_CSG_DCI_STIS_Msk               (0xf0000UL)               /*!< HRPWM0_CSG DCI: STIS (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG_DCI_SCS_Pos                (20UL)                    /*!< HRPWM0_CSG DCI: SCS (Bit 20)                                */
#define HRPWM0_CSG_DCI_SCS_Msk                (0x300000UL)              /*!< HRPWM0_CSG DCI: SCS (Bitfield-Mask: 0x03)                   */

/* -------------------------------  HRPWM0_CSG_IES  ------------------------------- */
#define HRPWM0_CSG_IES_SVLS_Pos               (0UL)                     /*!< HRPWM0_CSG IES: SVLS (Bit 0)                                */
#define HRPWM0_CSG_IES_SVLS_Msk               (0x3UL)                   /*!< HRPWM0_CSG IES: SVLS (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_IES_STRES_Pos              (2UL)                     /*!< HRPWM0_CSG IES: STRES (Bit 2)                               */
#define HRPWM0_CSG_IES_STRES_Msk              (0xcUL)                   /*!< HRPWM0_CSG IES: STRES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_IES_STPES_Pos              (4UL)                     /*!< HRPWM0_CSG IES: STPES (Bit 4)                               */
#define HRPWM0_CSG_IES_STPES_Msk              (0x30UL)                  /*!< HRPWM0_CSG IES: STPES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_IES_TRGES_Pos              (6UL)                     /*!< HRPWM0_CSG IES: TRGES (Bit 6)                               */
#define HRPWM0_CSG_IES_TRGES_Msk              (0xc0UL)                  /*!< HRPWM0_CSG IES: TRGES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG_IES_STES_Pos               (8UL)                     /*!< HRPWM0_CSG IES: STES (Bit 8)                                */
#define HRPWM0_CSG_IES_STES_Msk               (0x300UL)                 /*!< HRPWM0_CSG IES: STES (Bitfield-Mask: 0x03)                  */

