MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4100-F64K128/mcu.h
/* ------------------------------  HRPWM0_CSG0_DSV1  ------------------------------ */
#define HRPWM0_CSG0_DSV1_DSV1_Pos             (0UL)                     /*!< HRPWM0_CSG0 DSV1: DSV1 (Bit 0)                              */
#define HRPWM0_CSG0_DSV1_DSV1_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG0 DSV1: DSV1 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG0_DSV2  ------------------------------ */
#define HRPWM0_CSG0_DSV2_DSV2_Pos             (0UL)                     /*!< HRPWM0_CSG0 DSV2: DSV2 (Bit 0)                              */
#define HRPWM0_CSG0_DSV2_DSV2_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG0 DSV2: DSV2 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG0_SDSV1  ----------------------------- */
#define HRPWM0_CSG0_SDSV1_SDSV1_Pos           (0UL)                     /*!< HRPWM0_CSG0 SDSV1: SDSV1 (Bit 0)                            */
#define HRPWM0_CSG0_SDSV1_SDSV1_Msk           (0x3ffUL)                 /*!< HRPWM0_CSG0 SDSV1: SDSV1 (Bitfield-Mask: 0x3ff)             */

/* -------------------------------  HRPWM0_CSG0_SPC  ------------------------------ */
#define HRPWM0_CSG0_SPC_SPSWV_Pos             (0UL)                     /*!< HRPWM0_CSG0 SPC: SPSWV (Bit 0)                              */
#define HRPWM0_CSG0_SPC_SPSWV_Msk             (0x3fUL)                  /*!< HRPWM0_CSG0 SPC: SPSWV (Bitfield-Mask: 0x3f)                */

/* -------------------------------  HRPWM0_CSG0_CC  ------------------------------- */
#define HRPWM0_CSG0_CC_IBS_Pos                (0UL)                     /*!< HRPWM0_CSG0 CC: IBS (Bit 0)                                 */
#define HRPWM0_CSG0_CC_IBS_Msk                (0xfUL)                   /*!< HRPWM0_CSG0 CC: IBS (Bitfield-Mask: 0x0f)                   */
#define HRPWM0_CSG0_CC_IMCS_Pos               (8UL)                     /*!< HRPWM0_CSG0 CC: IMCS (Bit 8)                                */
#define HRPWM0_CSG0_CC_IMCS_Msk               (0x100UL)                 /*!< HRPWM0_CSG0 CC: IMCS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG0_CC_IMCC_Pos               (9UL)                     /*!< HRPWM0_CSG0 CC: IMCC (Bit 9)                                */
#define HRPWM0_CSG0_CC_IMCC_Msk               (0x600UL)                 /*!< HRPWM0_CSG0 CC: IMCC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_CC_ESE_Pos                (11UL)                    /*!< HRPWM0_CSG0 CC: ESE (Bit 11)                                */
#define HRPWM0_CSG0_CC_ESE_Msk                (0x800UL)                 /*!< HRPWM0_CSG0 CC: ESE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_CC_OIE_Pos                (12UL)                    /*!< HRPWM0_CSG0 CC: OIE (Bit 12)                                */
#define HRPWM0_CSG0_CC_OIE_Msk                (0x1000UL)                /*!< HRPWM0_CSG0 CC: OIE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_CC_OSE_Pos                (13UL)                    /*!< HRPWM0_CSG0 CC: OSE (Bit 13)                                */
#define HRPWM0_CSG0_CC_OSE_Msk                (0x2000UL)                /*!< HRPWM0_CSG0 CC: OSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_CC_BLMC_Pos               (14UL)                    /*!< HRPWM0_CSG0 CC: BLMC (Bit 14)                               */
#define HRPWM0_CSG0_CC_BLMC_Msk               (0xc000UL)                /*!< HRPWM0_CSG0 CC: BLMC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_CC_EBE_Pos                (16UL)                    /*!< HRPWM0_CSG0 CC: EBE (Bit 16)                                */
#define HRPWM0_CSG0_CC_EBE_Msk                (0x10000UL)               /*!< HRPWM0_CSG0 CC: EBE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_CC_COFE_Pos               (17UL)                    /*!< HRPWM0_CSG0 CC: COFE (Bit 17)                               */
#define HRPWM0_CSG0_CC_COFE_Msk               (0x20000UL)               /*!< HRPWM0_CSG0 CC: COFE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG0_CC_COFM_Pos               (18UL)                    /*!< HRPWM0_CSG0 CC: COFM (Bit 18)                               */
#define HRPWM0_CSG0_CC_COFM_Msk               (0x3c0000UL)              /*!< HRPWM0_CSG0 CC: COFM (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG0_CC_COFC_Pos               (24UL)                    /*!< HRPWM0_CSG0 CC: COFC (Bit 24)                               */
#define HRPWM0_CSG0_CC_COFC_Msk               (0x3000000UL)             /*!< HRPWM0_CSG0 CC: COFC (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG0_PLC  ------------------------------ */
#define HRPWM0_CSG0_PLC_IPLS_Pos              (0UL)                     /*!< HRPWM0_CSG0 PLC: IPLS (Bit 0)                               */
#define HRPWM0_CSG0_PLC_IPLS_Msk              (0xfUL)                   /*!< HRPWM0_CSG0 PLC: IPLS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG0_PLC_PLCL_Pos              (8UL)                     /*!< HRPWM0_CSG0 PLC: PLCL (Bit 8)                               */
#define HRPWM0_CSG0_PLC_PLCL_Msk              (0x300UL)                 /*!< HRPWM0_CSG0 PLC: PLCL (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_PLC_PSL_Pos               (10UL)                    /*!< HRPWM0_CSG0 PLC: PSL (Bit 10)                               */
#define HRPWM0_CSG0_PLC_PSL_Msk               (0x400UL)                 /*!< HRPWM0_CSG0 PLC: PSL (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG0_PLC_PLSW_Pos              (11UL)                    /*!< HRPWM0_CSG0 PLC: PLSW (Bit 11)                              */
#define HRPWM0_CSG0_PLC_PLSW_Msk              (0x800UL)                 /*!< HRPWM0_CSG0 PLC: PLSW (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_PLC_PLEC_Pos              (12UL)                    /*!< HRPWM0_CSG0 PLC: PLEC (Bit 12)                              */
#define HRPWM0_CSG0_PLC_PLEC_Msk              (0x3000UL)                /*!< HRPWM0_CSG0 PLC: PLEC (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_PLC_PLXC_Pos              (14UL)                    /*!< HRPWM0_CSG0 PLC: PLXC (Bit 14)                              */
#define HRPWM0_CSG0_PLC_PLXC_Msk              (0xc000UL)                /*!< HRPWM0_CSG0 PLC: PLXC (Bitfield-Mask: 0x03)                 */

